{"page_content": "link: _tuplegetter(0, 'Alias for field number 0')content: _tuplegetter(1, 'Alias for field number 1')"}
{"page_content": "link: https://www.bloomberg.com/opinion/articles/2024-06-12/porsche-and-volkswagen-both-deserve-full-time-ceoscontent: When Oliver Blume accepted the role of chief executive officer of Volkswagen AG in 2022, he did so on condition he retain his previous gig running Porsche AG, which he’s held since 2015. It looks increasingly like one job too many.Porsche is VW’s most valuable asset and, at the time of Blume’s promotion, the 911 manufacturer was preparing to go public. He is now CEO of both DAX-listed companies, devoting roughly half his time to each — an unusual arrangement that echoes how Carlos Ghosn once ran Renault SA and Nissan Motor Co. simultaneously, and how Elon Musk’s currently leads Tesla Inc. and SpaceX.I don’t doubt Blume’s capability as a manager, and I acknowledge that transforming VW will take time. But dividing his attention is becoming harder to justify; both groups face huge challenges and are underperforming peers.VW and Porsche have a complicated history. In 2008, Porsche tried to acquire the much larger VW but ended up being swallowed by it instead. In 2022, VW sold 25% of Porsche’s share capital: Institutional investors received non-voting shares, while the billionaire Porsche and Piech families’ holding company acquired voting shares. Thus VW continues to own 75% of Porsche.Investors have long had concerns about the “Doppelrolle,” and the topic came up again at the two companies’ annual shareholder meetings held in recent weeks: shareholders warned there are “only 24 hours in a day,” noting that Blume’s predecessor as VW CEO, Herbert Diess, stumbled despite having fewer responsibilities by the time he stepped down. Furthermore, Porsche and VW’s interests aren’t always aligned — a point also raised in Porsche’s IPO prospectus. “Choose a company. Listen to the capital market. Focus on one task,” Deka Investment’s Ingo Speich told the VW meeting last month.As usual, Blume batted away the critics. Both companies benefit “enormously” from the set-up, which enables him to keep a close eye on technology and processes at Porsche while thinking strategically for VW, he said. He reminded investors dual roles aren’t uncommon at Volkswagen — for a time Diess was CEO of both the VW Group and its namesake brand. Plus, it’s not like he doesn’t have help: VW’s chief financial officer, Arno Antlitz, also serves as chief operating officer, for example.In the past Blume has also reached for sporting metaphors to justify these leadership arrangements, comparing his own responsibilities to those of a soccer player-manager, or competing for both a league side and the national team. Porsche’s storied history, racing pedigree and patronage of sports and the arts make its CEO role one of the world’s most desirable jobs. Who would want to give it up?By contrast, running VW is one of the toughest corporate gigs around: It involves overseeing 10 brands and almost 700,000 employees (many of them unionized), while mollifying the Porsche and Piech families and VW’s home state of Lower Saxony, who together control a majority of VW’s voting shares.In fairness, Blume has so far shepherded these various constituencies rather well: Relations with the trade unions have improved, and he has the backing of VW’s family owners. Meanwhile, analysts applaud his determination to cut costs and openness to technological partnerships (as opposed to having VW foot the bill for everything). In terms of supervisory board level support, “we think the current management is better placed than any at VW for decades,” Citigroup Inc. analyst Harald Hendrikse told clients in March.Blume also provides fairly good value for money: Last year his total pay and benefits amounted to less than ˆ10 million ($10.8 million) for doing both jobs, according to VW’s annual report, which is far less than some rivals get for just one role.Alas, in the capital markets and operationally it’s a different story. VW’s preference shares have declined around 20% since Blume’s appointment, further compressing VW’s market capitalization to a derisory ˆ59 billion, less than smaller rival Stellantis NV.After deducting VW’s majority ownership of Porsche and truck maker Traton SE, this implies the rest of VW’s sprawling automotive empire is effectively worth nothing. My hope that listing Porsche would help reveal hidden value at VW has proven much too optimistic. VW investors still have a cornucopia of concerns, ranging from the company’s fading relevance in China and software delays, to a lack of competitive electric vehicles and the Audi division’s subpar performance.And Porsche isn’t faring much better: The stock is languishing around 10% below its IPO price, after the company was trounced in profitability and pricing power by luxury rival Ferrari NV. Porsche’s China sales are plunging, and resale values of the electric Taycan have hit the skids. There’s a lot riding on the launch of several new models, including the electric Macan SUV and hybrid 911.Relinquishing the Porsche role and focusing 100% on fixing VW would doubtless be wrenching for Blume, but it would demonstrate that VW is finally becoming a more “normal” company. Until then, investors may decide automakers with full-time drivers offer a smoother ride.More from Bloomberg OpinionWant more from Bloomberg Opinion? OPIN <GO>. Web readers, click here . Or subscribe to our daily newsletter ."}
{"page_content": "link: https://www.bloomberg.com/news/articles/2024-06-11/apple-hits-first-record-this-year-on-hopes-ai-will-fuel-upgradescontent: Apple Inc. shares rallied to their first record since December on Tuesday, as investor sentiment around the iPhone maker continues to improve.Shares soared 7.3% to $207.15 in their biggest one-day jump since November 2022. The gain added $215.1 billion to the company’s market capitalization, making for one of the biggest single-day value adds by any company in history, according to data compiled by Bloomberg. The stock added another 0.3% in extended trading.The record came in the wake of the company’s annual Worldwide Developers Conference, where it showcased a number of features related to artificial intelligence and announced a partnership with ChatGPT maker OpenAI. The event crystallized a strategy many investors felt had been missing from Apple amid AI-fueled rallies elsewhere within Big Tech.The stock has risen more than 25% off an April low, a rally that has returned it above a $3 trillion market cap and put it within striking distance of regaining its title as the largest company. Apple closed with a valuation of $3.18 trillion, just under Microsoft Corp. at $3.22 trillion.Apple’s AI event fueled hopes\nBloomberg Terminal\nthat customers will pay up for the next generation of iPhones, and both LightShed Partners and D.A. Davidson upgraded\nBloomberg Terminal\nthe stock on this thesis.“The addition of AI features to the newest iPhone comes at an ideal time for Apple,” wrote LightShed analyst Walter Piecyk. “IPhone revenue has been stagnant, and the vast majority of its installed base has old phones as the upgrade cycle slowed to record lows. It should therefore be an easy lift for Apple to stimulate a stabilization or inversion of the lengthening replacement cycle.”Concerns about the company’s growth were eased by a positive quarterly report in early May, when Apple also announced the largest stock buyback program in US history at $110 billion.That report has also supported the stock in recent weeks — May was the best month for Apple shares since July 2022 — but despite the record share price, Apple is only up 7.6% this year. It lags behind the Nasdaq 100 Index’s 14% gain, while stocks with more concrete AI exposure — including Microsoft, Amazon.com Inc., Alphabet Inc., and Meta Platforms Inc. — have all posted double-digit gains. AI-focused chipmaker Nvidia Corp. has soared 144%, briefly overtaking Apple in size.Among the so-called Magnificent Seven, only Tesla Inc. has done worse than Apple this year. The electric-vehicle maker has dropped more than 30% this year."}
